applications/test/pointMesh_with_IO/cavity/constant/pointMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointBoundaryMesh;
    location    "constant/pointMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    featEdges
    {
        type            fixedConstraint;
        meshPoints      (2 3 6 7);
        constraints     ((0 (0 0 0)) (0 (0 0 0)) (0 (0 0 0)) (0 (0 0 0)));
    }
)

// ************************************************************************* //
